bassem-mostafa/USB_STM32L496VGT6P/USB_STM32L496VGT6P.c
// #############################################################################
// #### Copyright ##############################################################
// #############################################################################

/*
 * Copyright 2024 BaSSeM
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *        http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */

// #############################################################################
// #### Description ############################################################
// #############################################################################

// #############################################################################
// #### Control Include(s) #####################################################
// #############################################################################

#include "Platform.h"

// #############################################################################
// #### Control Macro(s) #######################################################
// #############################################################################

#ifndef DEBUG
    #define DEBUG
#endif

#ifdef DEBUG
    #undef DEBUG
#endif

// #############################################################################
// #### File Guard #############################################################
// #############################################################################

#ifdef STM32L496xx

// #############################################################################
// #### Include(s) #############################################################
// #############################################################################

    #include "../../USB_Internal.h"
    #include "USB_STM32L496VGT6P.h"

    #include "stm32l4xx.h"
    #include "usbd_cdc_if.h"
    #include "usbd_core.h"
    #include "usbd_def.h"

// #############################################################################
// #### Private Macro(s) #######################################################
// #############################################################################

// #############################################################################
// #### Private Type(s) ########################################################
// #############################################################################

/**
 * @brief USB STM32L496VGT6P Operation
 *
 * @enum USB_STM32L496VGT6P_OperationType_t
 */
typedef enum USB_STM32L496VGT6P_OperationType
{
    USB_STM32L496VGT6P_OperationType_None = 0, ///< None
    USB_STM32L496VGT6P_OperationType_Pending,  ///< Pending
    USB_STM32L496VGT6P_OperationType_Commit,   ///< Commit
} USB_STM32L496VGT6P_OperationType_t;

/**
 * @brief USB STM32L496VGT6P Operation Handler
 */
typedef USB_STM32L496VGT6P_Status_t ( *USB_STM32L496VGT6P_OperationHandler_t )( USB_STM32L496VGT6P_t USBx );

/**
 * @brief USB STM32L496VGT6P Operation Context
 *
 * @struct USB_STM32L496VGT6P_OperationContext_t
 */
typedef struct USB_STM32L496VGT6P_OperationContext
{
} USB_STM32L496VGT6P_OperationContext_t;

/**
 * @brief USB STM32L496VGT6P Operation
 *
 * @struct USB_STM32L496VGT6P_Operation_t
 */
typedef struct USB_STM32L496VGT6P_Operation
{
    USB_STM32L496VGT6P_OperationType_t Type;       ///< Type
    USB_STM32L496VGT6P_OperationHandler_t Handler; ///< Handler
    USB_STM32L496VGT6P_Status_t Status;            ///< Status
    TIM_Timestamp_t Timeout;                       ///< Timeout
    USB_STM32L496VGT6P_OperationContext_t Context; ///< Context
} USB_STM32L496VGT6P_Operation_t;

/**
 * @brief USB STM32L496VGT6P Process Type
 *
 * @enum USB_STM32L496VGT6P_ProcessType_t
 */
typedef enum USB_STM32L496VGT6P_ProcessType
{
    USB_STM32L496VGT6P_ProcessType_None = 0,   ///< None
    USB_STM32L496VGT6P_ProcessType_Initialize, ///< Initialize
} USB_STM32L496VGT6P_ProcessType_t;

/**
 * @brief USB STM32L496VGT6P Process Handler
 */
typedef USB_STM32L496VGT6P_Status_t ( *USB_STM32L496VGT6P_ProcessHandler_t )( USB_STM32L496VGT6P_t USBx );

/**
 * @brief USB STM32L496VGT6P Process Context
 *
 * @struct USB_STM32L496VGT6P_ProcessContext_t
 */
typedef struct USB_STM32L496VGT6P_ProcessContext
{
    USB_STM32L496VGT6P_Operation_t Operation; ///< Operation
} USB_STM32L496VGT6P_ProcessContext_t;

/**
 * @brief USB STM32L496VGT6P Process
 *
 * @struct USB_STM32L496VGT6P_Process_t
 */
typedef struct USB_STM32L496VGT6P_Process
{
    USB_STM32L496VGT6P_ProcessType_t Type;       ///< Type
    USB_STM32L496VGT6P_ProcessHandler_t Handler; ///< Handler
    USB_STM32L496VGT6P_ProcessContext_t Context; ///< Context
} USB_STM32L496VGT6P_Process_t;

typedef enum USB_STM32L496VGT6P_Event
{
    USB_STM32L496VGT6P_Event_None = 0,
    USB_STM32L496VGT6P_Event_Interrupt = UTIL_BIT( 0 ),
    USB_STM32L496VGT6P_Event_Connected = UTIL_BIT( 1 ),
    USB_STM32L496VGT6P_Event_Disconnected = UTIL_BIT( 2 ),
    USB_STM32L496VGT6P_Event_StartOfFrame = UTIL_BIT( 3 ),
    USB_STM32L496VGT6P_Event_Setup = UTIL_BIT( 4 ),
    USB_STM32L496VGT6P_Event_Reset = UTIL_BIT( 5 ),
    USB_STM32L496VGT6P_Event_Suspend = UTIL_BIT( 6 ),
    USB_STM32L496VGT6P_Event_Resume = UTIL_BIT( 7 ),
    USB_STM32L496VGT6P_Event_Tx = UTIL_BIT( 8 ),
    USB_STM32L496VGT6P_Event_Rx = UTIL_BIT( 9 ),
    USB_STM32L496VGT6P_Event_TxComplete = UTIL_BIT( 10 ),
    USB_STM32L496VGT6P_Event_RxComplete = UTIL_BIT( 11 ),
    USB_STM32L496VGT6P_Event_TxIncomplete = UTIL_BIT( 12 ),
    USB_STM32L496VGT6P_Event_RxIncomplete = UTIL_BIT( 13 ),
    USB_STM32L496VGT6P_Event_DataTerminalReady_Enabled = UTIL_BIT( 14 ),
    USB_STM32L496VGT6P_Event_DataTerminalReady_Disabled = UTIL_BIT( 15 ),
} USB_STM32L496VGT6P_Event_t;

typedef enum USB_STM32L496VGT6P_DataTerminalReady
{
    USB_STM32L496VGT6P_DataTerminalReady_Disabled = 0,
    USB_STM32L496VGT6P_DataTerminalReady_Enabled,
} USB_STM32L496VGT6P_DataTerminalReady_t;

typedef struct USB_STM32L496VGT6P_InterfaceContext
{
    USB_STM32L496VGT6P_DataTerminalReady_t DataTerminalReady;
    BUFFER_t Transmit;
    BUFFER_t Receive;
} USB_STM32L496VGT6P_InterfaceContext_t;

typedef struct USB_STM32L496VGT6P_Instance
{
    GPIO_t VBUS_Sense;

    PCD_HandleTypeDef USBx;

    USB_STM32L496VGT6P_InterfaceContext_t Interface[ USB_STM32L496VGT6P_Interface_Count ];

