bassem-mostafa/USB_STM32L496VGT6P/USB_STM32L496VGT6P.c
    USB_STM32L496VGT6P_Event_t Event;

    USB_STM32L496VGT6P_Process_t Process;
} USB_STM32L496VGT6P_Instance_t;

typedef struct USB_STM32L496VGT6P_Context
{
    TIM_Timestamp_t Timestamp;
    USB_STM32L496VGT6P_Instance_t Instance[ USB_STM32L496VGT6P_Count ];
} USB_STM32L496VGT6P_Context_t;

// #############################################################################
// #### Private Method(s) Prototype ############################################
// #############################################################################

static GPIO_Status_t GPIO_CallbackOnInterrupt( GPIO_t GPIOx, GPIO_CallbackContext_t * Context );

void USB_STM32L496VGT6P_RxCpltCallback( uint8_t * pbuf, uint32_t * Len, uint8_t Interface );
void USB_STM32L496VGT6P_TxCpltCallback( uint8_t * pbuf, uint32_t * Len, uint8_t Interface );

void USB_STM32L496VGT6P_DataTerminalReadyCallback( uint8_t DTR, uint8_t Interface );

void OTG_FS_IRQHandler( void );

void HAL_PCD_SOFCallback( PCD_HandleTypeDef * hpcd );
void HAL_PCD_SetupStageCallback( PCD_HandleTypeDef * hpcd );
void HAL_PCD_ResetCallback( PCD_HandleTypeDef * hpcd );
void HAL_PCD_SuspendCallback( PCD_HandleTypeDef * hpcd );
void HAL_PCD_ResumeCallback( PCD_HandleTypeDef * hpcd );
void HAL_PCD_ConnectCallback( PCD_HandleTypeDef * hpcd );
void HAL_PCD_DisconnectCallback( PCD_HandleTypeDef * hpcd );

void HAL_PCD_DataOutStageCallback( PCD_HandleTypeDef * hpcd, uint8_t epnum );
void HAL_PCD_DataInStageCallback( PCD_HandleTypeDef * hpcd, uint8_t epnum );
void HAL_PCD_ISOOUTIncompleteCallback( PCD_HandleTypeDef * hpcd, uint8_t epnum );
void HAL_PCD_ISOINIncompleteCallback( PCD_HandleTypeDef * hpcd, uint8_t epnum );

static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Context_Initialize( void );
static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Context_Cycle( void );
static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Context_DeInitialize( void );

static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Instance_Initialize( USB_STM32L496VGT6P_t USBx );
static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Instance_Cycle( USB_STM32L496VGT6P_t USBx );
static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Instance_DeInitialize( USB_STM32L496VGT6P_t USBx );

static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_SetProcess( USB_STM32L496VGT6P_t USBx, USB_STM32L496VGT6P_ProcessType_t ProcessType );

static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_ProcessInitialize( USB_STM32L496VGT6P_t USBx );

static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_OperationCommitExecute( USB_STM32L496VGT6P_t USBx );
static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_OperationCommitResolve( USB_STM32L496VGT6P_t USBx );

// #############################################################################
// #### Private Variable(s) ####################################################
// #############################################################################

extern uint8_t UserTxBuffer0[ APP_TX_DATA_SIZE ];
extern uint8_t UserRxBuffer0[ APP_RX_DATA_SIZE ];
extern uint8_t UserTxBuffer1[ APP_TX_DATA_SIZE ];
extern uint8_t UserRxBuffer1[ APP_RX_DATA_SIZE ];
static USB_STM32L496VGT6P_Context_t USB_STM32L496VGT6P_Context = {
    .Instance[ USB_STM32L496VGT6P_1 ] = {
        .Interface[ USB_STM32L496VGT6P_Interface_1 ] = {
            .BUFFER_INITIALIZE( Transmit, UserTxBuffer0, APP_TX_DATA_SIZE ),
            .BUFFER_INITIALIZE( Receive, UserRxBuffer0, APP_RX_DATA_SIZE ),
        },
        .Interface[ USB_STM32L496VGT6P_Interface_2 ] = {
            .BUFFER_INITIALIZE( Transmit, UserTxBuffer1, APP_TX_DATA_SIZE ),
            .BUFFER_INITIALIZE( Receive, UserRxBuffer1, APP_RX_DATA_SIZE ),
        },
    },
};

// #############################################################################
// #### Private Method(s) ######################################################
// #############################################################################

static GPIO_Status_t GPIO_CallbackOnInterrupt( GPIO_t GPIOx, GPIO_CallbackContext_t * GPIO_Context )
{
    GPIO_Status_t GPIO_Status = GPIO_Status_Success;

    do
    {
        USB_Debug( "%s%s( GPIOx=%d, Context=%p )", UTIL_StringConcatenateConstant( UTIL_CSI_SelectGraphicRendition( UTIL_CSI_SelectGraphicRenditionColorForegroundBlack ), UTIL_CSI_SelectGraphicRendition( UTIL_CSI_SelectGraphicRenditionColorBackgroundCyan ) ), __FUNCTION__, GPIOx, GPIO_Context );

        USB_STM32L496VGT6P_Instance_t * Instance = ( USB_STM32L496VGT6P_Instance_t * ) GPIO_Context;

        /*
         * @brief  Handle USB VBUS detection upon external interrupt
         */
        PCD_HandleTypeDef * hpcd = &Instance->USBx;
        HAL_PCDEx_BCD_VBUSDetect( hpcd );
    }
    while ( 0 );

    return GPIO_Status;
}

void USB_STM32L496VGT6P_RxCpltCallback( uint8_t * pbuf, uint32_t * Len, uint8_t Interface )
{
    BUFFER_Status_t BUFFER_Status = BUFFER_Status_Success;

    USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];

    Instance->Event |= USB_STM32L496VGT6P_Event_RxComplete;

    if ( ( BUFFER_Status = BUFFER_PushMemoryBackCircular( &Instance->Interface[ Interface ].Receive, pbuf, *Len ) ) != BUFFER_Status_Success )
    {
        USB_Warning( "%s: %s", __FUNCTION__, "Receive Buffer FULL!" );
    }
}

void USB_STM32L496VGT6P_TxCpltCallback( uint8_t * pbuf, uint32_t * Len, uint8_t Interface )
{
    BUFFER_Status_t BUFFER_Status = BUFFER_Status_Success;

    USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];

    Instance->Event |= USB_STM32L496VGT6P_Event_TxComplete;

    if ( ( BUFFER_Status = BUFFER_Reset( &Instance->Interface[ Interface ].Transmit ) ) != BUFFER_Status_Success )
    {
        // FIXME
    }

    #if 1
        // TODO
    #else
    USB_STM32L496VGT6P_Instance_t * Instance = USB_Context.Instance[ USB_1 ].STM32L496VGT6P;
    if ( *Len <= Instance->Context->Transmit.Length )
    {
        UTIL_MemoryCopy( &Instance->Context->Transmit.Content[ 0 ], &Instance->Context->Transmit.Content[ *Len ], Instance->Context->Transmit.Length - *Len );
        Instance->Context->Transmit.Length -= *Len;
        Instance->Context->Status = USB_STM32L496VGT6P_Status_Success;
    }
    else
    {
        USB_Error( "%s: Unexpected Size %d out of %d", __FUNCTION__, *Len, Instance->Context->Transmit.Length );

