bassem-mostafa/USB_STM32L496VGT6P/USB_STM32L496VGT6P.c
        Instance->Context->Transmit.Length = 0;
        Instance->Context->Status = USB_STM32L496VGT6P_Status_Error;
    }
    #endif
}

void USB_STM32L496VGT6P_DataTerminalReadyCallback( uint8_t DTR, uint8_t Interface )
{
    USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];

    if ( DTR )
    {
        Instance->Event |= USB_STM32L496VGT6P_Event_DataTerminalReady_Enabled;
        Instance->Interface[ Interface ].DataTerminalReady = USB_STM32L496VGT6P_DataTerminalReady_Enabled;
    }
    else
    {
        Instance->Event |= USB_STM32L496VGT6P_Event_DataTerminalReady_Disabled;
        Instance->Interface[ Interface ].DataTerminalReady = USB_STM32L496VGT6P_DataTerminalReady_Disabled;
    }
}

void OTG_FS_IRQHandler( void )
{
    USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];

    Instance->Event |= USB_STM32L496VGT6P_Event_Interrupt;

    PCD_HandleTypeDef * hpcd = &Instance->USBx;
    HAL_PCD_IRQHandler( hpcd );
}

void HAL_PCD_SOFCallback( PCD_HandleTypeDef * hpcd )
{
    USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];

    Instance->Event |= USB_STM32L496VGT6P_Event_StartOfFrame;

    USBD_LL_SOF( ( USBD_HandleTypeDef * ) hpcd->pData );
}

void HAL_PCD_SetupStageCallback( PCD_HandleTypeDef * hpcd )
{
    USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];

    Instance->Event |= USB_STM32L496VGT6P_Event_Setup;

    USBD_LL_SetupStage( ( USBD_HandleTypeDef * ) hpcd->pData, ( uint8_t * ) hpcd->Setup );
}

void HAL_PCD_ResetCallback( PCD_HandleTypeDef * hpcd )
{
    USBD_SpeedTypeDef speed = USBD_SPEED_FULL;
    USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];

    Instance->Event |= USB_STM32L496VGT6P_Event_Reset;

    if ( hpcd->Init.speed != PCD_SPEED_FULL )
    {
        Error_Handler( );
    }
    /* Set Speed. */
    USBD_LL_SetSpeed( ( USBD_HandleTypeDef * ) hpcd->pData, speed );

    /* Reset Device. */
    USBD_LL_Reset( ( USBD_HandleTypeDef * ) hpcd->pData );
}

void HAL_PCD_SuspendCallback( PCD_HandleTypeDef * hpcd )
{
    USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];

    Instance->Event |= USB_STM32L496VGT6P_Event_Suspend;

    __HAL_PCD_GATE_PHYCLOCK( hpcd );
    /* Inform USB library that core enters in suspend Mode. */
    USBD_LL_Suspend( ( USBD_HandleTypeDef * ) hpcd->pData );
    /* Enter in STOP mode. */
    if ( hpcd->Init.low_power_enable )
    {
        /* Set SLEEPDEEP bit and SleepOnExit of Cortex System Control Register. */
        SCB->SCR |= ( uint32_t ) ( ( uint32_t ) ( SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk ) );
    }
}

void HAL_PCD_ResumeCallback( PCD_HandleTypeDef * hpcd )
{
    USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];

    Instance->Event |= USB_STM32L496VGT6P_Event_Resume;

    __HAL_PCD_UNGATE_PHYCLOCK( hpcd );

    if ( hpcd->Init.low_power_enable )
    {
        /* Reset SLEEPDEEP bit of Cortex System Control Register. */
        SCB->SCR &= ( uint32_t ) ~( ( uint32_t ) ( SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk ) );
        // FIXME Instead of using SystemClockConfig_Resume();
        //       Use directly SystemClock_Config() through KERNEL;
        KERNEL_ClockEnable( KERNEL_All );
    }
    USBD_LL_Resume( ( USBD_HandleTypeDef * ) hpcd->pData );
}

void HAL_PCD_ConnectCallback( PCD_HandleTypeDef * hpcd )
{
    USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];

    Instance->Event |= USB_STM32L496VGT6P_Event_Connected;

    USBD_LL_DevConnected( ( USBD_HandleTypeDef * ) hpcd->pData );
}

void HAL_PCD_DisconnectCallback( PCD_HandleTypeDef * hpcd )
{
    USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];

    Instance->Event |= USB_STM32L496VGT6P_Event_Disconnected;

    USBD_LL_DevDisconnected( ( USBD_HandleTypeDef * ) hpcd->pData );
}

void HAL_PCD_DataOutStageCallback( PCD_HandleTypeDef * hpcd, uint8_t epnum )
{
    USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];

    Instance->Event |= USB_STM32L496VGT6P_Event_Rx;

    USBD_LL_DataOutStage( ( USBD_HandleTypeDef * ) hpcd->pData, epnum, hpcd->OUT_ep[ epnum ].xfer_buff );
}

void HAL_PCD_DataInStageCallback( PCD_HandleTypeDef * hpcd, uint8_t epnum )
{
    USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];

    Instance->Event |= USB_STM32L496VGT6P_Event_Tx;

    USBD_LL_DataInStage( ( USBD_HandleTypeDef * ) hpcd->pData, epnum, hpcd->IN_ep[ epnum ].xfer_buff );
}

void HAL_PCD_ISOOUTIncompleteCallback( PCD_HandleTypeDef * hpcd, uint8_t epnum )
{
    USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];

    Instance->Event |= USB_STM32L496VGT6P_Event_RxIncomplete;

    USBD_LL_IsoOUTIncomplete( ( USBD_HandleTypeDef * ) hpcd->pData, epnum );
}

void HAL_PCD_ISOINIncompleteCallback( PCD_HandleTypeDef * hpcd, uint8_t epnum )
{
    USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];

    Instance->Event |= USB_STM32L496VGT6P_Event_TxIncomplete;

    USBD_LL_IsoINIncomplete( ( USBD_HandleTypeDef * ) hpcd->pData, epnum );
}

static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Context_Initialize( void )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;
    BUFFER_Status_t BUFFER_Status = BUFFER_Status_Success;

    do
    {
        USB_Trace( "%s( void )", __FUNCTION__ );

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_GetTimestamp( USB_TIM, &USB_STM32L496VGT6P_Context.Timestamp ) ) != TIM_Status_Success )
        {
            Status = USB_STM32L496VGT6P_Status_Error;
            break;
        }

        // FIXME Remove the usage of `MX_USB_DEVICE_Init()`
    #if 1
        extern PCD_HandleTypeDef hpcd_USB_OTG_FS;
        extern void MX_USB_DEVICE_Init( void );
        MX_USB_DEVICE_Init( );
        USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ];
        Instance->USBx = hpcd_USB_OTG_FS;
        // FIX Let the USBD use our instance
        // ( ( USBD_HandleTypeDef * ) ( hpcd_USB_OTG_FS.pData ) )->pData = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ].USBx; // @note Replaced by the following
        USBD_HandleTypeDef * pdev = ( USBD_HandleTypeDef * ) hpcd_USB_OTG_FS.pData;
        pdev->pData = &USB_STM32L496VGT6P_Context.Instance[ USB_STM32L496VGT6P_1 ].USBx;

        // FIXME the following is skipped due to USB enumeration still in progress on this stage
        // @note the following follows @ref MX_USB_DEVICE_Init() interface registration
        for ( USB_STM32L496VGT6P_Interface_t Interface = USB_STM32L496VGT6P_Interface_1; Interface < USB_STM32L496VGT6P_Interface_Count; ++Interface )
        {
            uint32_t classId = USBD_CMPSIT_GetClassID( pdev, CLASS_TYPE_CDC, Interface );
            if ( classId == 0xFFU )
            {
                USB_Warning( "Couldn't Retrieve CDC Interface %d Class ID", Interface );
                continue;
            }

