bassem-mostafa/USB_STM32L496VGT6P/USB_STM32L496VGT6P.c
            USB_Debug( "CDC Interface %d Has Class ID %d", Interface, classId );

            USB_Warning( "CDC Interface Buffers initialization has been skipped" );
            continue;

            USBD_CDC_HandleTypeDef * USB_Device_CDC = ( USBD_CDC_HandleTypeDef * ) pdev->pClassDataCmsit[ classId ];
            if ( ( BUFFER_Status = BUFFER_Initialize( &Instance->Interface[ Interface ].Transmit, USB_Device_CDC->TxBuffer, USB_Device_CDC->TxLength ) ) != BUFFER_Status_Success )
            {
                Status = USB_STM32L496VGT6P_Status_Error;
                break;
            }

            if ( ( BUFFER_Status = BUFFER_Initialize( &Instance->Interface[ Interface ].Receive, USB_Device_CDC->RxBuffer, USB_Device_CDC->RxLength ) ) != BUFFER_Status_Success )
            {
                Status = USB_STM32L496VGT6P_Status_Error;
                break;
            }
        }
    #endif
    }
    while ( 0 );

    return Status;
}

static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Context_Cycle( void )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;

    do
    {
        USB_Trace( "%s( void )", __FUNCTION__ );

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_GetTimestamp( USB_TIM, &USB_STM32L496VGT6P_Context.Timestamp ) ) != TIM_Status_Success )
        {
            Status = USB_STM32L496VGT6P_Status_Error;
            break;
        }
    }
    while ( 0 );

    return Status;
}

static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Context_DeInitialize( void )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;

    do
    {
        USB_Trace( "%s( void )", __FUNCTION__ );

        UTIL_UNUSED( USB_STM32L496VGT6P_Context );
    }
    while ( 0 );

    return Status;
}

static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Instance_Initialize( USB_STM32L496VGT6P_t USBx )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;
    GPIO_Status_t GPIO_Status = GPIO_Status_Success;

    do
    {
        USB_Trace( "%s( USBx=%d )", __FUNCTION__, USBx );

        USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USBx ];

        switch ( USBx )
        {
            case USB_STM32L496VGT6P_1:
                // TODO Configure GPIOs
                if ( ( GPIO_Status = GPIO_Configure( Instance->VBUS_Sense, ( GPIO_Configuration_t ) {
                                                                               .Mode = GPIO_Mode_Interrupt,
                                                                               .Function = GPIO_Function_Default, // FIXME Should be GPIO_Function_USB_VSENSE
                                                                               .Pull = GPIO_Pull_None,
                                                                           } ) )
                     != GPIO_Status_Success )
                {
                    Status = USB_Status_Error;
                    break;
                }

                if ( ( GPIO_Status = GPIO_SetOnInterrupt( Instance->VBUS_Sense, ( GPIO_OnInterrupt_t ) { .Callback = GPIO_CallbackOnInterrupt, .Context = Instance } ) ) != GPIO_Status_Success )
                {
                    Status = USB_Status_Error;
                    break;
                }
                break;

            default:
                Status = USB_STM32L496VGT6P_Status_NotSupported;
                break;
        }
        if ( Status != USB_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        Instance->Event = USB_STM32L496VGT6P_Event_None;

        Status = USB_STM32L496VGT6P_SetProcess( USBx, USB_STM32L496VGT6P_ProcessType_Initialize );
    }
    while ( 0 );

    return Status;
}

static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Instance_Cycle( USB_STM32L496VGT6P_t USBx )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;
    USB_STM32L496VGT6P_Status_t STM32L496VGT6P_Status = USB_STM32L496VGT6P_Status_Success;

    do
    {
        USB_Trace( "%s( USBx=%d )", __FUNCTION__, USBx );

        USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USBx ];

        USB_STM32L496VGT6P_Process_t * Process = &Instance->Process;
        USB_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;
        USB_STM32L496VGT6P_Event_t Event = Instance->Event; // CAUTION: Has to copy events occurred at the early start of the cycle, so as to be cleared at the end of the cycle,
                                                            //          which let events occurs after that for the next cycle call
        Instance->Event &= ~Event;                          //          Clear captured events

        if ( Operation->Handler != NULL )
        {
            if ( ( STM32L496VGT6P_Status = Operation->Handler( USBx ) ) != USB_STM32L496VGT6P_Status_Success )
            {
                Status = STM32L496VGT6P_Status;
                // FIXME Operation reported non success status, is there any action ?
            }
        }

        if ( Process->Handler != NULL )
        {
            if ( ( STM32L496VGT6P_Status = Process->Handler( USBx ) ) != USB_STM32L496VGT6P_Status_Success )
            {
                Status = STM32L496VGT6P_Status;
                // FIXME Process reported non success status, is there any action ?
            }
        }

        if ( ( Event & USB_STM32L496VGT6P_Event_Interrupt ) == USB_STM32L496VGT6P_Event_Interrupt )
        {
            Event &= ~USB_STM32L496VGT6P_Event_Interrupt;
            USB_Trace( "Interrupt: USBx=%d", USBx );
            // TODO Invoke Callback
        }

        if ( ( Event & USB_STM32L496VGT6P_Event_Connected ) == USB_STM32L496VGT6P_Event_Connected )
        {
            Event &= ~USB_STM32L496VGT6P_Event_Connected;
            USB_Debug( "Connected: USBx=%d", USBx );
            // TODO Invoke Callback
        }

        if ( ( Event & USB_STM32L496VGT6P_Event_Disconnected ) == USB_STM32L496VGT6P_Event_Disconnected )
        {
            Event &= ~USB_STM32L496VGT6P_Event_Disconnected;
            USB_Debug( "DisConnected: USBx=%d", USBx );
            // TODO Invoke Callback
        }

        if ( ( Event & USB_STM32L496VGT6P_Event_StartOfFrame ) == USB_STM32L496VGT6P_Event_StartOfFrame )
        {
            Event &= ~USB_STM32L496VGT6P_Event_StartOfFrame;
            USB_Debug( "Start Of Frame: USBx=%d", USBx );
            // TODO Invoke Callback
        }

        if ( ( Event & USB_STM32L496VGT6P_Event_Setup ) == USB_STM32L496VGT6P_Event_Setup )
        {
            Event &= ~USB_STM32L496VGT6P_Event_Setup;
            USB_Debug( "Setup: USBx=%d", USBx );
            // TODO Invoke Callback
        }

