bassem-mostafa/USB_STM32L496VGT6P/USB_STM32L496VGT6P.c
        if ( ( Event & USB_STM32L496VGT6P_Event_Reset ) == USB_STM32L496VGT6P_Event_Reset )
        {
            Event &= ~USB_STM32L496VGT6P_Event_Reset;
            USB_Debug( "Reset: USBx=%d", USBx );
            // TODO Invoke Callback
        }

        if ( ( Event & USB_STM32L496VGT6P_Event_Suspend ) == USB_STM32L496VGT6P_Event_Suspend )
        {
            Event &= ~USB_STM32L496VGT6P_Event_Suspend;
            USB_Debug( "Suspend: USBx=%d", USBx );
            // TODO Invoke Callback
        }

        if ( ( Event & USB_STM32L496VGT6P_Event_Resume ) == USB_STM32L496VGT6P_Event_Resume )
        {
            Event &= ~USB_STM32L496VGT6P_Event_Resume;
            USB_Debug( "Resume: USBx=%d", USBx );
            // TODO Invoke Callback
        }

        if ( ( Event & USB_STM32L496VGT6P_Event_Tx ) == USB_STM32L496VGT6P_Event_Tx )
        {
            Event &= ~USB_STM32L496VGT6P_Event_Tx;
            USB_Debug( "TX InProgress: USBx=%d", USBx );
            // TODO Invoke Callback
        }

        if ( ( Event & USB_STM32L496VGT6P_Event_Rx ) == USB_STM32L496VGT6P_Event_Rx )
        {
            Event &= ~USB_STM32L496VGT6P_Event_Rx;
            USB_Debug( "RX InProgress: USBx=%d", USBx );
            // TODO Invoke Callback
        }

        if ( ( Event & USB_STM32L496VGT6P_Event_TxComplete ) == USB_STM32L496VGT6P_Event_TxComplete )
        {
            Event &= ~USB_STM32L496VGT6P_Event_TxComplete;
            USB_Debug( "TX Complete: USBx=%d", USBx );
            // TODO Invoke Callback
        }

        if ( ( Event & USB_STM32L496VGT6P_Event_RxComplete ) == USB_STM32L496VGT6P_Event_RxComplete )
        {
            Event &= ~USB_STM32L496VGT6P_Event_RxComplete;
            USB_Debug( "RX Complete: USBx=%d", USBx );
            // TODO Invoke Callback
        }

        if ( ( Event & USB_STM32L496VGT6P_Event_TxIncomplete ) == USB_STM32L496VGT6P_Event_TxIncomplete )
        {
            Event &= ~USB_STM32L496VGT6P_Event_TxIncomplete;
            USB_Debug( "TX Incomplete: USBx=%d", USBx );
            // TODO Invoke Callback
        }

        if ( ( Event & USB_STM32L496VGT6P_Event_RxIncomplete ) == USB_STM32L496VGT6P_Event_RxIncomplete )
        {
            Event &= ~USB_STM32L496VGT6P_Event_RxIncomplete;
            USB_Debug( "RX Incomplete: USBx=%d", USBx );
            // TODO Invoke Callback
        }

        if ( ( Event & USB_STM32L496VGT6P_Event_DataTerminalReady_Enabled ) == USB_STM32L496VGT6P_Event_DataTerminalReady_Enabled )
        {
            Event &= ~USB_STM32L496VGT6P_Event_DataTerminalReady_Enabled;
            USB_Debug( "DTR Enabled: USBx=%d", USBx );
            // TODO Invoke Callback
        }

        if ( ( Event & USB_STM32L496VGT6P_Event_DataTerminalReady_Disabled ) == USB_STM32L496VGT6P_Event_DataTerminalReady_Disabled )
        {
            Event &= ~USB_STM32L496VGT6P_Event_DataTerminalReady_Disabled;
            USB_Debug( "DTR Disabled: USBx=%d", USBx );
            // TODO Invoke Callback
        }

        if ( Event )
        {
            USB_Warning( "Not handled events %X: USBx=%d", Event, USBx );
        }

        for ( USB_STM32L496VGT6P_Interface_t Interface = USB_STM32L496VGT6P_Interface_1; Interface < USB_STM32L496VGT6P_Interface_Count; ++Interface )
        {
            USB_STM32L496VGT6P_InterfaceContext_t * InterfaceContext = &Instance->Interface[ Interface ];
            BUFFER_t * Transmit = &InterfaceContext->Transmit;

            if ( Transmit->Length < 1 || InterfaceContext->DataTerminalReady != USB_STM32L496VGT6P_DataTerminalReady_Enabled )
            {
                continue;
            }

            USBD_StatusTypeDef USBD_Status = USBD_OK;
            if ( ( USBD_Status = CDC_Transmit_FS( Transmit->Content, Transmit->Length, Interface ) ) != USBD_OK )
            {
                Status = USB_STM32L496VGT6P_Status_Error;
            }
        }
    }
    while ( 0 );

    return Status;
}

static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Instance_DeInitialize( USB_STM32L496VGT6P_t USBx )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;
    do
    {
        USB_Trace( "%s( USBx=%d )", __FUNCTION__, USBx );

        USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USBx ];

        UTIL_UNUSED( Instance );

        // FIXME
        Status = USB_STM32L496VGT6P_Status_NotSupported;
    }
    while ( 0 );
    return Status;
}

static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_SetProcess( USB_STM32L496VGT6P_t USBx, USB_STM32L496VGT6P_ProcessType_t ProcessType )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;

    do
    {
        USB_Trace( "%s( USBx=%d, ProcessType=%d )", __FUNCTION__, USBx, ProcessType );

        USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USBx ];
        USB_STM32L496VGT6P_Process_t * Process = &Instance->Process;
        USB_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        switch ( ProcessType )
        {
            case USB_STM32L496VGT6P_ProcessType_None:
                Process->Handler = NULL;
                break;

            case USB_STM32L496VGT6P_ProcessType_Initialize:
                Process->Handler = USB_STM32L496VGT6P_ProcessInitialize;
                break;

            default:
                USB_Warning( "%s Not Handled Type %d", __FUNCTION__, ProcessType );
                Status = USB_STM32L496VGT6P_Status_NotSupported;
                break;
        }
        if ( Status != USB_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        Process->Type = ProcessType;

        Operation->Handler = NULL;
        Operation->Status = USB_STM32L496VGT6P_Status_Success;
        Operation->Timeout = USB_STM32L496VGT6P_Context.Timestamp;

        switch ( ProcessType )
        {
            case USB_STM32L496VGT6P_ProcessType_None:
                Operation->Type = USB_STM32L496VGT6P_OperationType_None;
                break;

            default:
                Operation->Type = USB_STM32L496VGT6P_OperationType_Pending;
                break;
        }
    }
    while ( 0 );

