bassem-mostafa/USB_STM32L496VGT6P/USB_STM32L496VGT6P.c
    return Status;
}

static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_ProcessInitialize( USB_STM32L496VGT6P_t USBx )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;

    do
    {
        USB_Trace( "%s( USBx=%d )", __FUNCTION__, USBx );

        USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USBx ];
        USB_STM32L496VGT6P_Process_t * Process = &Instance->Process;
        USB_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Process->Type != USB_STM32L496VGT6P_ProcessType_Initialize )
        {
            USB_Error( "%s Got %d Expected %d", __FUNCTION__, Process->Type, USB_STM32L496VGT6P_ProcessType_Initialize );
            Status = USB_STM32L496VGT6P_Status_Error;
            break;
        }

        if ( Operation->Handler != NULL )
        {
            // Operation In-progress
            break;
        }

        if ( Operation->Status != USB_STM32L496VGT6P_Status_Success )
        {
            Operation->Type = USB_STM32L496VGT6P_OperationType_None;
        }

        switch ( Operation->Type )
        {
            case USB_STM32L496VGT6P_OperationType_Pending:
                Operation->Status = USB_STM32L496VGT6P_OperationCommitExecute( USBx );
                break;

            case USB_STM32L496VGT6P_OperationType_Commit:
            default:
                // TODO Invoke Callback
                // if ( Instance->OnComplete != NULL )
                // {
                //     Instance->OnComplete( USBx, Operation->Status );
                // }
                Status = USB_STM32L496VGT6P_SetProcess( USBx, USB_STM32L496VGT6P_ProcessType_None );
                break;
        }
    }
    while ( 0 );

    return Status;
}

static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_OperationCommitExecute( USB_STM32L496VGT6P_t USBx )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;

    do
    {
        USB_Trace( "%s( USBx=%d )", __FUNCTION__, USBx );

        USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USBx ];
        USB_STM32L496VGT6P_Process_t * Process = &Instance->Process;
        USB_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

    // FIXME Keep CubeMX generated configurations as is for now
    #if 0
      HAL_StatusTypeDef HAL_Status = HAL_ERROR;
      if ( ( HAL_Status = HAL_USB_Init( &Instance->Context->USBx ) ) != HAL_OK )
      {
        Status = USB_STM32L496VGT6P_Status_Error;
        break;
      }
    #endif

        Operation->Type = USB_STM32L496VGT6P_OperationType_Commit;
        Operation->Handler = USB_STM32L496VGT6P_OperationCommitResolve;
        Operation->Status = USB_STM32L496VGT6P_Status_Success;
        Operation->Timeout = USB_STM32L496VGT6P_Context.Timestamp;

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_Timestamp_AddMillisecond( &Operation->Timeout, 0 ) ) != TIM_Status_Success )
        {
            Status = USB_STM32L496VGT6P_Status_Error;
            break;
        }
    }
    while ( 0 );

    return Status;
}

static USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_OperationCommitResolve( USB_STM32L496VGT6P_t USBx )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;

    do
    {
        USB_Trace( "%s( USBx=%d )", __FUNCTION__, USBx );

        USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USBx ];
        USB_STM32L496VGT6P_Process_t * Process = &Instance->Process;
        USB_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Operation->Type != USB_STM32L496VGT6P_OperationType_Commit )
        {
            USB_Error( "%s Got %d Expected %d", __FUNCTION__, Operation->Type, USB_STM32L496VGT6P_OperationType_Commit );
            Status = USB_STM32L496VGT6P_Status_Error;
            break;
        }

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_IsExpiredTimestamp( USB_TIM, &Operation->Timeout ) ) == TIM_Status_Success )
        {
            Operation->Status = USB_STM32L496VGT6P_Status_Success;
            Operation->Handler = NULL;
            break;
        }
    }
    while ( 0 );

    return Status;
}

// #############################################################################
// #### Public Method(s) #######################################################
// #############################################################################

USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Initialize( USB_STM32L496VGT6P_t USBx )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;

    do
    {
        USB_Trace( "%s( USBx=%d )", __FUNCTION__, USBx );

        if ( ( Status = USB_STM32L496VGT6P_Context_Initialize( ) ) != USB_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        if ( ( Status = USB_STM32L496VGT6P_Instance_Initialize( USBx ) ) != USB_STM32L496VGT6P_Status_Success )
        {
            break;
        }
    }
    while ( 0 );

    return Status;
}

USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Cycle( USB_STM32L496VGT6P_t USBx )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;

    do
    {
        USB_Trace( "%s( USBx=%d )", __FUNCTION__, USBx );

        if ( ( Status = USB_STM32L496VGT6P_Context_Cycle( ) ) != USB_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        if ( ( Status = USB_STM32L496VGT6P_Instance_Cycle( USBx ) ) != USB_STM32L496VGT6P_Status_Success )
        {
            break;
        }
    }
    while ( 0 );

    return Status;
}

USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_DeInitialize( USB_STM32L496VGT6P_t USBx )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;

    do
    {
        USB_Trace( "%s( USBx=%d )", __FUNCTION__, USBx );

        if ( ( Status = USB_STM32L496VGT6P_Instance_DeInitialize( USBx ) ) != USB_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        if ( ( Status = USB_STM32L496VGT6P_Context_DeInitialize( ) ) != USB_STM32L496VGT6P_Status_Success )
        {
            break;
        }
    }
    while ( 0 );

