bassem-mostafa/USB_STM32L496VGT6P/USB_STM32L496VGT6P.c
    return Status;
}

USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_IsReady( USB_STM32L496VGT6P_t USBx, USB_STM32L496VGT6P_Interface_t Interface )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;

    do
    {
        USB_Trace( "%s( USBx=%d )", __FUNCTION__, USBx );

        USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USBx ];

        // FIXME
        // if ( Process->Type != USB_STM32L496VGT6P_ProcessType_None
        //      || Operation->Type != USB_STM32L496VGT6P_OperationType_None )
        // {
        //     Status = USB_STM32L496VGT6P_Status_Busy;
        //     break;
        // }

        if ( Instance->Interface[ Interface ].DataTerminalReady != USB_STM32L496VGT6P_DataTerminalReady_Enabled )
        {
            Status = USB_STM32L496VGT6P_Status_Error;
            break;
        }
    }
    while ( 0 );

    return Status;
}

USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Write( USB_STM32L496VGT6P_t USBx, USB_STM32L496VGT6P_Interface_t Interface, USB_STM32L496VGT6P_Data_t * Data, USB_STM32L496VGT6P_DataLength_t DataLength )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;
    BUFFER_Status_t BUFFER_Status = BUFFER_Status_Success;

    do
    {
        USB_Trace( "%s( USBx=%d, Interface=%d, Data=%p, Length=%d )", __FUNCTION__, USBx, Interface, Data, DataLength );

        USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USBx ];

        if ( ( BUFFER_Status = BUFFER_PushMemoryBack( &Instance->Interface[ Interface ].Transmit, Data, DataLength ) ) != BUFFER_Status_Success )
        {
            Status = USB_STM32L496VGT6P_Status_Error;
            break;
        }
    }
    while ( 0 );
    return Status;
}

USB_STM32L496VGT6P_Status_t USB_STM32L496VGT6P_Read( USB_STM32L496VGT6P_t USBx, USB_STM32L496VGT6P_Interface_t Interface, USB_STM32L496VGT6P_Data_t * Data, USB_STM32L496VGT6P_DataLength_t DataLength )
{
    USB_STM32L496VGT6P_Status_t Status = USB_STM32L496VGT6P_Status_Success;
    BUFFER_Status_t BUFFER_Status = BUFFER_Status_Success;

    do
    {
        USB_Trace( "%s( USBx=%d, Interface=%d, Data=%p, Length=%d )", __FUNCTION__, USBx, Interface, Data, DataLength );

        USB_STM32L496VGT6P_Instance_t * Instance = &USB_STM32L496VGT6P_Context.Instance[ USBx ];

        if ( ( BUFFER_Status = BUFFER_PullMemoryFrontCircular( &Instance->Interface[ Interface ].Receive, Data, DataLength ) ) != BUFFER_Status_Success )
        {
            Status = USB_STM32L496VGT6P_Status_Error;
            break;
        }
    }
    while ( 0 );
    return Status;
}

// #############################################################################
// #### Public Variable(s) #####################################################
// #############################################################################

const char USB_STM32L496VGT6P_VERSION[] = "0.0.0.v20260818-0345";

// #############################################################################
// #### File Guard #############################################################
// #############################################################################

#endif /* STM32L496xx */

// #############################################################################
// #### END OF FILE ############################################################
// #############################################################################
